import { useTranslations } from 'next-intl';
import { Card } from '@fmicodes/fmicodes-ui/lib/components/common/card/components/card';
import { Metadata } from 'next';
import { getTranslations } from 'next-intl/server';
import { RegulationItem } from '@fmicodes/fmicodes-ui/lib/components/site/client';

export async function generateMetadata(): Promise<Metadata> {
  const t = await getTranslations('regulations-page');

  return {
    title: `${t('title')} | FMI{Codes} 2024`,
    description: t('description'),
  };
}

export default function RegulationsPage() {
  const t = useTranslations('regulations-page');

  const regulations = [
    {
      title: 'Какво е FMI{Codes}?',
      content: (
        <p>
          FMI{'{Codes}'} е ежегодният ни хакатон (състезание по програмиране), в
          което отборите имат два дни да направят авторски проект по зададената
          от организаторите тема, използвайки всякакви технологии. Вратите на
          Факултета са отворени през цялото време, а ние от ФСС при ФМИ сме на
          Ваше разположение и през двата дни.
        </p>
      ),
    },
    {
      title: 'Кой има право да участва и как?',
      content: (
        <p>
          Ако сте редовен студент, в който и да е университет в България, можете
          да се регистрирате за участие на страницата за регистрация на сайта на
          събитието.
        </p>
      ),
    },
    {
      title: 'Онлайн регистрация',
      content: (
        <>
          <p>
            Онлайн регистрацията за индивидуални участници завършва преди
            присъствената регистрация, както е означено в програмата. Участието
            е напълно безплатно.
          </p>
          <p>
            Когато се регистрирате, ще получите достъп до нова страница от сайта
            (Дискорд), на която ще получите инструкции за влизане и
            удостоверяване в Discord сървъра на събитието, което ще ви даде
            достъп до отборните ви канали. През Discord сървъра ще се осъществи
            част от комуникацията с организатори и ментори.
          </p>
          <p>
            <b>ВАЖНО</b>: Регистрацията за отбори се затваря, когато се достигне
            максималния брой от 18 <b>потвърдени</b> отбора. Потвърден отбор е
            отбор с поне <b>трима</b> регистрирани участника.
          </p>
        </>
      ),
    },
    {
      title: 'Съставяне на отбори',
      content: (
        <>
          <p>
            Студентите имат правото сами да съставят отборите си, като в един
            отбор могат да участват между 3 и 6 човека.{' '}
            <b>Максималният брой отбори е 18.</b>
          </p>
          <p>
            Помислили сме и за хората, които нямат отбор. Ето защо създадохме
            канал в Discord, чрез който можете да се включите в отбор, търсещ си
            още съотборници.
          </p>
          <p>
            <b>ВАЖНО:</b> Ако до 15.03 включително не сте си намерили отбор,
            няма да можете да участвате на хакатона независимо дали сте се
            регистрирали като индивидуален участник.
          </p>
          <p>Всеки индивидуален участник може да участва само в един отбор.</p>
        </>
      ),
    },
    {
      title: 'Условия за работа на място',
      content: (
        <>
          <p>Носете си собствени лаптопи/компютри и периферия.</p>
          <p>
            Не Ви задължаваме да работите по проектите си във ФМИ през цялото
            време, ако все пак решите да сте на място през двата дни, ние от ФСС
            ще сме на Ваше разположение, ако имате нужда от нещо, стига да можем
            да Ви помогнем.
          </p>
          <p>
            Всеки отбор <b>трябва</b> да има GitHub repository, в което да качва
            своя код, още от началото на хакатона.
          </p>
          <p>
            <b>Задължително</b> е да качите линк към вашето GitHub repository в
            обозначеното място за това в панела на вашия отбор на сайта и да
            качите своята презенация преди началото на представянията.
          </p>
          <p>
            <b>Забранено</b> е да работите по проектите си преди началото на
            хакатона и след началото на представянията.
          </p>
          <p>
            <b>При установено нарушение, отбора се дисквалифицира.</b>
          </p>
        </>
      ),
    },
    {
      title: 'Присъствена регистрация',
      content: (
        <p>
          Преди откриването на FMI{'{Codes}'} Ви очакваме във фоайето на
          Факултета, където ще запишем Вашето присъствие. Присъствената
          регистрация ще е отворена до откриване на събитието.
        </p>
      ),
    },
    {
      title: 'Ментори',
      content: (
        <>
          <p>
            Всеки отбор ще има право да си избере ментор през сайта на
            събитието. Менторите ще отговарят и помагат най-вече на отборите, от
            които са избрани, но при нужда могат да консултират и другите
            отбори.
          </p>
          <p>
            Комуникацията с менторите ще се осъществява чрез нашия Discord
            сървър, както и на живо във Факултета.
          </p>
          <p>
            Менторите ще бъдат на Ваше разположение в часовите слотове, които са
            отбелязали.
          </p>
        </>
      ),
    },
    {
      title: 'Презентиране',
      content: (
        <>
          <p>
            В указаните часове в програмата ще можете да тествате Вашите проекти
            и презентация в зала 325 преди официалното им представяне.
          </p>
          <p>
            Всеки отбор ще представи своя проект пред жури, съставено от
            представители на златните ни спонсори и представител на ФМИ.
          </p>
          <p>
            Всеки отбор ще може да представи проекта си в рамките на{' '}
            <b>8 минути</b>.
          </p>
          <p>
            <b>Важно:</b> Всеки отбор е длъжен да спазва времевия си диапазон.
            След изтичането на времето водещите ще прекъснат отбора и ще се
            премине към сесията за въпроси. Сесията за въпроси е <b>5 минути</b>
            .
          </p>
        </>
      ),
    },
    {
      title: 'Критерии за оценяване',
      content: (
        <ol className="list-decimal list-inside">
          <li className="mb-4">
            <b>Идея (15 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>Актуалност (3 т.)</li>
              <li>Оригиналност на проекта (8 т.)</li>
              <li>Приложимост (4 т.)</li>
            </ol>
          </li>
          <li className="mb-4">
            <b>Реализация (55 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>Каква част от проекта е завършена? (20 т.)</li>
              <li>
                Какви функционалности има проектът и колко сложни са за
                реализация? (15 т.)
              </li>
              <li>Каква част от реализацията е авторска? (8 т.)</li>
              <li>
                Спазени ли са общоприети практики за програмиране/изработката на
                проекта? (4 т.)
              </li>
              <li>
                Отборът използвал ли е подходящи технологии, за да реализира
                проекта? (4 т.)
              </li>
              <li>Добре ли е структуриран проекта? (4 т.)</li>
            </ol>
          </li>
          <li>
            <b>Презентация (30 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>Колко добре подготвен е отборът за презентацията? (10 т.)</li>
              <li>Демонстрация на проекта (12 т.)</li>
              <li>
                Колко добре отборът се справя с отговорите на въпросите на
                журито? (8 т.)
              </li>
            </ol>
          </li>
        </ol>
      ),
    },
    {
      title: 'Награждаване',
      content: (
        <>
          <p>
            Най-добрите 3 проекта от финалите ще бъдат наградени съответно с 1.,
            2. и 3. място.
          </p>
          <p>
            Всеки златен и сребърен спонсор награждава по един отбор, който по
            някакъв начин се е отличил в очите на техните представители в журито
            или менторите. Затова не се обезкуражавайте, ако не сте в първите 3
            места, може да сте останали в сърцата на нашите спонсори…
          </p>
          <p>
            … или в нашите (на организаторите), защото има награда и за отбора,
            който е оставил най-добро впечатление на ФСС. 💖
          </p>
        </>
      ),
    },
    {
      title: 'Отговорност',
      content: (
        <>
          <p>
            Участниците са длъжни да се съобразяват с програмата за провеждане
            на хакатона (откриване, време за работа, представяне пред журито и
            др.), да спазват всички инструкции на организаторите на събитието и
            на доброволците, които помагат за организирането му.
          </p>
          <p>
            Организаторите не носят отговорност за Вашата комуникация със
            съотборниците Ви по време на хакатона.
          </p>
          <p>
            <b>
              Поемате отговорност да почистите след себе си залите, в които сте
              работили и да пазите сградата на ФМИ.
            </b>
          </p>
        </>
      ),
    },
    {
      title: 'Дисквалификация',
      content: (
        <ul className="list-disc list-inside">
          <li>
            Ако журито сметне, че даден проект не е авторски или не е по темата,
            съответният отбор може да бъде дисквалифициран.
          </li>
          <li>
            Организаторите на събитието може да дисквалифицират участник, ако
            поведението на участника е непристойно или пречи на провеждането на
            хакатона.
          </li>
          <li>
            Не се толерира тормоз над работната група на FMI {'{Codes}'},
            доброволците и участниците в събитието, както и над менторите и
            журито, под каквато и да е форма.
          </li>
          <li>
            Организаторите си запазват правото да дисквалифицират отбор, ако
            проектът им не е подходящ за събитието, има неморално съдържание или
            зловредна цел.
          </li>
          <li>
            Отбор, който не изпълнява инструкциите на организаторите, може да
            бъде дисквалифициран.
          </li>
        </ul>
      ),
    },
    {
      title: 'Политика за бисквитки и поверителност',
      content: (
        <>
          <p>
            За да подобрим представянето на уеб сайта си и Вашето потребителско
            преживяване, понякога използваме HTTP-бисквитки (HTTP cookies), или
            просто бисквитки. С използването на сайта Вие се съгласявате с това.
          </p>
          <ul className="list-disc list-inside">
            <li>
              Какво представляват бисквитките?
              <p>
                Бисквитките са малки текстови файлове, които се запазват на
                Вашия компютър или мобилно устройство, когато посещавате нашия
                уеб сайт. Те позволяват на уеб сайта да запаметява Вашите
                действия и предпочитания, за определен период от време, за да не
                се налага да ги въвеждате всеки път, когато посещавате сайта или
                преминавате от една страница към друга, което ни помага да Ви
                предоставяме съдържание, което смятаме, че ще бъде полезно и
                интересно за Вас.
              </p>
            </li>
            <li>
              Как и какви бисквитки използваме?
              <ol className="list-disc list-inside pl-4">
                <li>
                  Функционални бисквитки
                  <p>
                    Използваме бисквитки, които позволяват на уеб сайта да
                    запаметява Вашите действия и предпочитания (като например
                    потребителско име, език, възраст, размер на шрифта и други
                    настройки за показване) за определен период от време, за да
                    не се налага да ги въвеждате всеки път, когато посещавате
                    сайта или преминавате от една страница към друга.
                  </p>
                </li>
                <li>
                  Бисквитки за сигурност
                  <p>
                    Използваме бисквитки от гледна точка на сигурност, чиято цел
                    е да предотвратяват измамническо използване на
                    идентификационни данни за вход, както и за защита
                    информацията от неупълномощени страни.
                  </p>
                </li>
                <li>
                  Лични данни от бисквитките
                  <p>
                    Личните данни събрани от бисквитките се използват единствено
                    и само за осъществяването на конкретни функции в сайта,
                    свързани със самия потребител.
                  </p>
                </li>
              </ol>
            </li>

            <li>
              Поверителност
              <p>
                Чрез регистрация във FMI{'{Codes}'} Вие се съгласявате с нашата
                политика за поверителност. FMI{'{Codes}'} не предоставя Вашите
                данни на трети лица. Вашите данни не се използват за
                персонализация. Всичките данни, които сте предоставили на FMI
                {'{Codes}'}, се използват единствено за организацията на
                събитието от организационния екип.
              </p>
            </li>
          </ul>
        </>
      ),
    },
  ];

  return (
    <>
      <h1 className="text-2xl sm:text-4xl md:text-6xl font-black uppercase my-4 truncate text-clip">
        {t('title')}
      </h1>

      <Card className="px-4">
        {regulations.map((regulation) => (
          <RegulationItem
            key={regulation.title}
            title={regulation.title}
            content={regulation.content}
          />
        ))}

        <p className="text-xl py-4 text-center">
          Ние от ФСС на ФМИ Ви пожелаваме успех и се надяваме да се забавлявате.
          За допълнително въпроси може да се свържете с нас по всички социални
          мрежи.
        </p>
      </Card>
    </>
  );
}
