import { useTranslations } from 'next-intl';
import { Card } from '@fmicodes/fmicodes-ui/lib/components/common/card/components/card';
import { Metadata } from 'next';
import { getTranslations } from 'next-intl/server';
import { RegulationItem } from '@fmicodes/fmicodes-ui/lib/components/site/client';

export async function generateMetadata(): Promise<Metadata> {
  const t = await getTranslations('regulations-page');

  return {
    title: `${t('title')} | FMI{Codes} 2025`,
    description: t('description'),
  };
}

export default function RegulationsPage() {
  const t = useTranslations('regulations-page');

  const regulations = [
    {
      title: 'Какво е FMI{Codes}?',
      content: (
        <p>
          FMI{'{Codes}'} е ежегоден хакатон, организиран от Факултетен
          Студентски Съвет (ФСС) при Факултет по Математика и Информатика (ФМИ)
          на Софийски Университет (СУ) &quot;Св. Климент Охридски&quot;. В
          същността си FMI{'{Codes}'} е състезание по програмиране, в което
          отборите имат два дни, в които да изградят собствен проект по зададена
          от организаторите тема, без поставени ограничения върху технологиите,
          използвани от участниците.
        </p>
      ),
    },
    {
      title: 'Право на участие във FMI{Codes}',
      content: (
        <>
          <p>Право на участие във FMI{'{Codes}'} имат:</p>
          <ul className="list-disc list-inside">
            <li>Всички редовни студенти в университет в България</li>
            <li>
              Всички студенти в университет в България, които са прекъснали за
              текущата учебна година, но не повече от веднъж за курса си на
              обучение
            </li>
            <li>
              Допуска се участие на до двама редовни студенти в университет в
              чужбина в отбор
            </li>
          </ul>
          <p>
            Право на участие във FMI{'{Codes}'} нямат лицата, които са изрично
            посочени в{' '}
            <a
              className="font-bold underline transition-colors duration-200 ease-in-out hover:text-[#725979]"
              href="https://docs.google.com/document/d/1wej5IlbaT7MoyaW89tG8QigZN9H_5IS7_wPXHIzc0T4/edit?usp=sharing"
            >
              списъка с дисквалифицирани участници
            </a>{' '}
            на уебсайта на събитието.
          </p>
        </>
      ),
    },
    {
      title: 'Онлайн регистрация',
      content: (
        <>
          <p>
            За да бъдат допуснати до участие, участниците и отборите трябва да
            бъдат регистрирани на сайта на FMI{'{Codes}'} :
          </p>
          <p>
            Онлайн регистрацията завършва преди присъствената регистрация, както
            е означено в програмата. Участието е напълно безплатно.
          </p>
          <p>
            След извършена онлайн регистрация, участниците получават достъп до
            нова страница. Там те получават инструкции за влизане и
            удостоверяване в Discord сървъра на събитието и достъп до отборните
            канали. През този сървър се осъществява и част от комуникацията с
            организатори и ментори.
          </p>
          <p>
            Регистрацията на отбори се затваря, когато бъде достигнат
            максималният брой от 18 потвърдени отбора. За потвърден отбор се
            смята отбор, съставен от поне трима регистрирани участника, които
            отговарят на условията от точка 2.
          </p>
        </>
      ),
    },
    {
      title: 'Съставяне на отбори',
      content: (
        <>
          <p>
            Участниците имат право сами да съставят отборите си. Един отбор може
            да бъде съставен от между 3 и 6 участника. Максималният брой
            участващи отбори е 18.
          </p>
          <p>
            За участниците, които нямат отбор е създаден канал в Discord, чрез
            който могат да се включат в такъв. Ако до официалното откриване има
            участник, който все още не е включен в отбор, той няма да може да
            участва в хакатона, независимо дали е регистриран като индивидуален
            участник.
          </p>
          <p>Всеки участник може да участва само в един отбор.</p>
          <p>
            Организаторите не отговарят за вътрешната комуникация на отделните
            отбори по време на събитието. Те единствено предоставят канал за
            осъществяването й.
          </p>
        </>
      ),
    },
    {
      title: 'Изисквания за работа',
      content: (
        <>
          <ol className="list-disc list-inside">
            <li>
              Всеки отбор трябва да има публично GitHub repository, в което да
              качва своя код от началото до края на хакатона. Линкът към
              repository-то трябва да бъде качен в обозначеното за това място в
              панела на съответния отбор на сайта.
            </li>
            <li>
              Забранена е работата върху проекта преди началото и след края на
              хакатона.
            </li>
            <li>
              Участниците се задължават да разработват проектите си единствено
              по време на състезателния период.
            </li>
            <li>
              Участниците се задължават да демонстрират ясна история на
              разработката, което включва но не се ограничава до поддържане на
              подробна история на промените (commits) от създаването до
              предаването на проекта.
            </li>
            <li>
              Участниците са задължени да направят своя последен commit и да
              предадат презентацията си не по-късно от началния час на
              закриването, посочен в програмата.
            </li>
            <li>
              Отбор, който не предостави достатъчно подробна история на
              разработката на проекта си (например са регистрирани много малък
              брой commits) или чийто проект изглежда предварително подготвен,
              може да бъде дисквалифициран.
            </li>
            <li>
              Участниците се задължават да разкрият изрично всяко използване на
              външни ресурси, код, библиотеки, APIs и др. в кода на проекта си.
              Това включва, но не се ограничава до публично достъпни
              библиотеки/хранилища, шаблони или всякаква вече съществуваща
              работа.
            </li>
            <li>
              При констатирана липса на подходящо приписване за използването
              външни ресурси от този тип за даден проект, отборът разработващ
              съответния проект може да бъде дисквалифициран.
            </li>
            <li>
              Забранено е в представянето на проекта да участват лица, които не
              са официално регистрирани участници.
            </li>
            <li>
              Забранено е в разработката на проекта да участват лица, които не
              са официално регистрирани участници или ментори.
            </li>
            <li>
              Участниците са задължени да тестват проектите и презентацията си в
              указаната в програмата зала преди тяхното официално представяне.
            </li>
            <li>
              Редът на представяне се определя чрез честен жребий. Редът и
              неговото определяне ще бъдат обявени на втория ден от събитието.
              На участниците се забранява да представят в ред, различен от
              определения от жребия.
            </li>
            <li>
              Участниците се задължават да присъстват в залата за представяне от
              самото начало, обявено в програмата, до края на своето
              представяне.
            </li>
            <li>
              Участниците трябва да направят представянето на проектите си от
              собствен комплютър.
            </li>
          </ol>
        </>
      ),
    },
    {
      title: 'Права и условия за работа на място',
      content: (
        <>
          <p>
            Сградата на факултета ще бъде на разположение за работа през цялото
            време на хакатона. Организатори и доброволци ще бъдат на
            разположение да съдействат, когато имат тази възможност. Участниците
            не са задължени през цялото време да работят на територията на
            факултета.
          </p>
          <p>
            Участниците използват собствени компютри/лаптопи, периферия и
            допълнителен хардуер.
          </p>
          <p>
            Преди началото на хакатона във факултета се извършва задължителна
            присъствена регистрация. Организаторите ще посрещнат участниците във
            фоайето, за да запишат тяхното присъствие. Присъствената регистрация
            е отворена до откриването на събитието.
          </p>
          <p>
            Забранено е разместване на мебели и техника, които са собственост на
            факултета
          </p>
        </>
      ),
    },
    {
      title: 'Отговорност',
      content: (
        <>
          <p>Участниците във FMI{'{Codes}'} са длъжни да:</p>
          <ul className="list-disc list-inside">
            <li>се съобразяват с програмата на провеждане на хакатона;</li>
            <li>
              спазват всички инструкции на организаторите и доброволците на
              събитието;
            </li>
            <li>
              почистват след себе си залите, които са им били предоставени за
              работа;
            </li>
            <li>пазят сградата на ФМИ.</li>
          </ul>
        </>
      ),
    },
    {
      title: 'Дисквалифициране на отбори от FMI{Codes}',
      content: (
        <>
          <p>
            Отбори са дисквалифицирани от FMI{'{Codes}'} при някое от следните
            условия:
          </p>
          <ul className="list-disc list-inside">
            <li>Отборът не е изпълнил изискванията, посочени в точка 6.</li>
            <li>
              Журито преценява, че даден проект не е авторски или не е по
              темата, зададена от организаторите.
            </li>
            <li>
              Поведението на участник от отбора се счете за непристойно или
              пречи на провеждането на хакатона.
            </li>
            <li>
              Извършен е тормоз над организаторите, доброволците, участниците,
              менторите или журито под каквато и да е форма по време на
              събитието.
            </li>
            <li>Съдържанието на проекта е неморално или със зловредна цел.</li>
          </ul>
        </>
      ),
    },
    {
      title: 'Ментори',
      content: (
        <>
          <p>
            Всеки отбор има право да избере свой ментор през сайта на събитието.
            Менторите отговарят и помагат на отборите, от които са избрани.
            Допуска се менторите да консултират и други отбори при необходимост.
          </p>
          <p>
            Комуникацията с менторите се осъществява през Discord сървъра на
            събитието и на живо във факултета.
          </p>
          <p>
            Менторите ще бъдат на разположение на участниците в часовите
            слотове, които са посочили предварително.
          </p>
        </>
      ),
    },
    {
      title: 'Презентиране',
      content: (
        <>
          <p>
            В указаните часове в програмата участниците ще тестват проектите и
            презентацията си в указаната в програмата зала, преди тяхното
            официално представяне.
          </p>
          <p>
            Всеки отбор ще представи своя проект пред жури, което е съставено от
            представители на златните спонсори на FMI{'{Codes}'} и представител
            на ФМИ.
          </p>
          <p>Всеки отбор представя проекта си в рамките на 8 минути.</p>
          <p>
            Всеки отбор е длъжен да спазва времевия си диапазон. След изтичането
            на времето, водещите прекъсват отбора и се преминава към сесията за
            въпроси. Продължителността на сесията за въпроси е 5 минути.
          </p>
        </>
      ),
    },
    {
      title: 'Критерии за оценяване',
      content: (
        <ol className="list-decimal list-inside">
          <li className="mb-4">
            <b>Идея (15 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>До колко е актуален замисълът на проекта? (3 т.)</li>
              <li>До колко е оригинална идеята на проекта? (8 т.)</li>
              <li>До колко проектът е приложим? (4 т.)</li>
            </ol>
          </li>
          <li className="mb-4">
            <b>Реализация (55 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>Каква част от проекта е завършена? (20 т.)</li>
              <li>
                Какви функционалности има проектът и колко са сложни за
                реализация? (15 т.)
              </li>
              <li>Каква част от реализацията е авторска? (7 т.)</li>
              <li>
                Спазени ли са общоприети практики за програмиране/изработка на
                проекта? (3 т.)
              </li>
              <li>
                Отборът използвал ли е подходящи технологии, за да реализира
                проекта? (4 т.)
              </li>
              <li>Добре ли е структуриран проектът? (3 т.)</li>
              <li>
                Проектът има ли добра история на промените(commit history)? (3
                т.)
              </li>
            </ol>
          </li>
          <li>
            <b>Презентация (30 т.)</b>
            <ol
              className="list-inside pl-4"
              style={{
                listStyleType: 'lower-alpha',
              }}
            >
              <li>Колко добре е подготвен отборът за презентацията? (10 т.)</li>
              <li>Колко добре презентацията демонстрира проекта? (12 т.)</li>
              <li>
                Колко добре отборът се справя с отговорите на въпросите на
                журито? (8 т.)
              </li>
            </ol>
          </li>
        </ol>
      ),
    },
    {
      title: 'Награждаване',
      content: (
        <>
          <p>
            Най-добрите 3 проекта от финалите ще бъдат наградени съответно с
            първо, второ и трето място. Паричните награди за първо, второ, трето
            място са съответно 4500лв, 3000лв. и 2000лв.
          </p>
          <p>
            Всеки златен и сребърен спонсор награждава по един отбор, който се е
            отличил в очите на неговите представители.
          </p>
          <p>
            Един отбор получава наградата на организаторите от ФСС при ФМИ,
            който им е оставил най-добро впечатление.
          </p>
          <p>
            Наградите на победителите се изплащат по банков път. За тази цел по
            един участник от всеки отбор победител трябва да представи валидна
            банкова сметка, на която да бъдат прехвърлени парите
          </p>
        </>
      ),
    },
    {
      title: 'Политика за бисквитки и поверителност',
      content: (
        <>
          <p>
            За да подобрят представянето на уеб сайта на събитието и
            потребителското преживяване на участниците, организаторите използват
            HTTP-бисквитки (HTTP cookies). С използването на сайта участниците
            се съгласяват с това.
          </p>
          <p className="font-bold underline text-xl">
            Какво представляват бисквитките?
          </p>
          <p>
            Бисквитките са текстови файлове, които се запазват на компютъра или
            мобилното устройство на участниците, когато посещават уеб сайта на
            събитието. Те позволяват на сайта да запаметява действията и
            предпочитанията на потребителите. Това се прави с цел да не бъде
            необходимо данните да бъдат въвеждани всеки път, когато участниците
            посещават сайта или преминават на различни страници. Това помага на
            организаторите да предоставят съдържание, което смятат, че е полезно
            и интересно за участниците.
          </p>
          <p>Как и какви бисквитки са използвани?</p>
          <p>
            Функционалните бисквитки позволяват на уеб сайта да запаметява
            действията и предпочитанията на потребителите за определен период от
            време, за да не се налага да бъдат въвеждани всеки път при посещение
            на сайта или преминаване между различни страници.
          </p>
          <p>
            Използвани са бисквитки за сигурност, чиято цел е да предотвратяват
            измамническо използване на идентификационни данни за вход, както и
            за защита на информацията на неупълномощени страни.
          </p>
          <p>
            Личните данни, събрани от бисквитките, се използват единствено и
            само за осъществяване на конкретни функции в сайта, свързани със
            самия потребител.
          </p>
          <p>Поверителност</p>
          <p>
            Чрез регистрация във FMI{'{Codes}'} участниците се съгласяват с
            политиката за поверителност на организаторите.
          </p>
          <p>
            FMI{'{Codes}'} не предоставя данните на участниците на трети лица.
          </p>
          <p>Данните на участниците не се използват за персонализация.</p>
          <p>
            Всички данни, които участниците са предоставили на FMI{'{Codes}'},
            се използват единствено за организацията на събитието от
            организационния екип.
          </p>
          <p>
            Снимки на участниците, заснети по време на събитието, ще бъдат
            използвани единствено с цел рекламиране на събитието в социалните
            мрежи на ФСС.
          </p>
        </>
      ),
    },
  ];

  return (
    <>
      <h1 className="text-center text-2xl sm:text-4xl md:text-6xl font-black uppercase my-4 truncate text-clip">
        {t('title')}
      </h1>

      <Card className="px-4">
        {regulations.map((regulation) => (
          <div key={`${regulation.title}-${regulation.content}`} className="">
            <RegulationItem
              key={regulation.title}
              title={regulation.title}
              content={regulation.content}
            />
          </div>
        ))}

        <div className="flex items-center justify-center">
          <p className="text-xl py-4 text-center max-w-screen-lg">
            Организаторите от ФСС при ФМИ пожелаваме на участниците успех! За
            допълнителни въпроси участниците могат да се свържат с
            организаторите във всички{' '}
            <a
              className=" underline"
              href="https://linktr.ee/lifeinfmi?utm_source=linktree_profile_share&ltsid=e27fd093-5fa0-4920-b9cc-1590081815de"
            >
              социални мрежи
            </a>
          </p>
        </div>
      </Card>
    </>
  );
}
